УправДом/src/InformationRegisters/СведенияПоПлатежам/СведенияПоПлатежам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоПлатежам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущиеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Enums/МесяцыОплаты/МесяцыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МесяцыОплаты</name>
  <enumValues>
    <name>Январь</name>
  </enumValues>
  <enumValues>
    <name>Февраль</name>
  </enumValues>
  <enumValues>
    <name>Март</name>
  </enumValues>
  <enumValues>
    <name>Апрель</name>
  </enumValues>
  <enumValues>
    <name>Май</name>
  </enumValues>
  <enumValues>
    <name>Июнь</name>
  </enumValues>
  <enumValues>
    <name>Июль</name>
  </enumValues>
  <enumValues>
    <name>Август</name>
  </enumValues>
  <enumValues>
    <name>Сентябрь</name>
  </enumValues>
  <enumValues>
    <name>Октябрь</name>
  </enumValues>
  <enumValues>
    <name>Ноябрь</name>
  </enumValues>
  <enumValues>
    <name>Декабрь</name>
  </enumValues>
</mdclass:Enum>

УправДом/src/Catalogs/ВидыПлатежей/ВидыПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПлатежей</name>
  <predefined>
    <items>
      <name>Газоснабжение</name>
      <description>Газоснабжение</description>
    </items>
    <items>
      <name>ДопУслугиИнтернет</name>
      <description>Допуслуги интернет</description>
    </items>
    <items>
      <name>Интернет</name>
      <description>Интернет</description>
    </items>
    <items>
      <name>ТКО</name>
      <description>ТКО</description>
    </items>
    <items>
      <name>Электроснабжение</name>
      <description>Электроснабжение</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправДом/src/CommonModules/РаботаСДокументамиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция РассчитатьСлужебнуюДату(ВыбранныйМесяц, ВыбранныйГод) Экспорт
	
	// Проверяем, что все данные заполнены
	Если ВыбранныйМесяц = Неопределено ИЛИ ВыбранныйГод = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерМесяца = 0;
	

	Если ВыбранныйМесяц = Перечисления.МесяцыОплаты.Январь Тогда
		НомерМесяца = 1;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Февраль Тогда
		НомерМесяца = 2;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Март Тогда
		НомерМесяца = 3;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Апрель Тогда
		НомерМесяца = 4;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Май Тогда
		НомерМесяца = 5;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Июнь Тогда
		НомерМесяца = 6;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Июль Тогда
		НомерМесяца = 7;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Август Тогда
		НомерМесяца = 8;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Сентябрь Тогда
		НомерМесяца = 9;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Октябрь Тогда
		НомерМесяца = 10;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Ноябрь Тогда
		НомерМесяца = 11;
	ИначеЕсли ВыбранныйМесяц = Перечисления.МесяцыОплаты.Декабрь Тогда
		НомерМесяца = 12;
	КонецЕсли;
	
	// Формируем и возвращаем дату
	Возврат Дата(ВыбранныйГод, НомерМесяца, 1);
	
	
КонецФункции

// Функция заполняет реквизиты шапки документа на основе вида платежа.
//
// Параметры:
//  ВидПлатежа - СправочникСсылка.ВидыПлатежей - Вид платежа, по которому нужно получить данные.
//
// Возвращаемое значение:
// Неопределено, Структура - Содержит заполненные реквизиты. Если данные не найдены, возвращается Неопределено.
Функция ПолучитьДанныеДляЗаполненияШапки(Знач ВидПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПлатежей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыПлатежей.Счетчик КАК Счетчик,
		|	ВидыПлатежей.Счетчик.Номер КАК СчетчикНомер,
		|	ВидыПлатежей.Счетчик.ДатаУстановки КАК СчетчикДатаУстановки
		|ИЗ
		|	Справочник.ВидыПлатежей КАК ВидыПлатежей
		|ГДЕ
		|	ВидыПлатежей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидПлатежа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		 Выборка = РезультатЗапроса.Выбрать();	
		 Выборка.Следующий();
		 
		 // Формируем структуру с результатами
		 Результат = Новый Структура;
		 Результат.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		 Результат.Вставить("Счетчик", Выборка.Счетчик);
		 Результат.Вставить("НомерСчетчика", Выборка.СчетчикНомер);
		 Результат.Вставить("ДатаУстановки", Выборка.СчетчикДатаУстановки);
		 
		 Возврат Результат;
	Иначе 
		 // Если данные не найдены, возвращаем Неопределено
		 Возврат Неопределено;
	 КонецЕсли;
	 	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает данные о показаниях из записи за предыдущий месяц.
// Использует СрезПоследних для максимальной производительности.
//
// Параметры:
//  ВидПлатежа - СправочникСсылка.ВидыПлатежей - Вид платежа.
//  ОплачиваемыйПериод - Дата - Дата в текущем месяце, за который формируется документ.
//
// Возвращаемое значение:
//  Неопределено,Структура - Содержит ПоказанияНачисления и СтарыеПоказания.
//              Если данные за прошлый месяц не найдены, возвращает Неопределено.
//
Функция ПолучитьПоказанияЗаПрошлыйМесяц(Знач ВидПлатежа, ОплачиваемыйПериод) Экспорт
	
	// 1. Определяем границы ПРОШЛОГО месяца. 
	// Это пока избыточно. Но в будущем, если в месяце будет несколько записей.
	НачалоПрошлогоМесяца = НачалоМесяца(ДобавитьМесяц(ОплачиваемыйПериод, -1));
	КонецПрошлогоМесяца = КонецМесяца(НачалоПрошлогоМесяца);
	
	// 2. Запрос к регистру сведений
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СведенияПоПлатежам.ТекущиеПоказания КАК ТекущиеПоказания,
		|	СведенияПоПлатежам.ПоказанияНачисления КАК ПоказанияНачисления
		|ИЗ
		|	РегистрСведений.СведенияПоПлатежам КАК СведенияПоПлатежам
		|ГДЕ
		|	СведенияПоПлатежам.ВидПлатежа = &ВидПлатежа
		|	И СведенияПоПлатежам.Период МЕЖДУ &НачалоПрошлогоМесяца И &КонецПрошлогоМесяца
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"; // Берем последнюю запись в месяце, если их было несколько
	
	Запрос.УстановитьПараметр("ВидПлатежа", ВидПлатежа);
	Запрос.УстановитьПараметр("НачалоПрошлогоМесяца", НачалоПрошлогоМесяца);
	Запрос.УстановитьПараметр("КонецПрошлогоМесяца", КонецПрошлогоМесяца);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// 3. Получаем данные и формируем структуру
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	ДанныеПоказаний = Новый Структура;
	ДанныеПоказаний.Вставить("ПоказанияНачисления", Выборка.ТекущиеПоказания);
	ДанныеПоказаний.Вставить("СтарыеПоказания", Выборка.ПоказанияНачисления); // Берем поле из регистра
	
	Возврат ДанныеПоказаний;

КонецФункции

#КонецОбласти
